/* ======================================
    ■ ■ ■ 연산자(Operator) ■ ■ ■
======================================= */

// 비트 단위 연산자

public class Test024
{
	public static void main(String[] args)
	{
		int a = 10, b = -10;
		
		System.out.printf("~a : %d%n", ~a);
		System.out.printf("~b : %d%n", ~b);

		int k = 25;

		System.out.printf("복습 하는 상기 : ~k : %d%n", ~k);
	}
}

// 실행 결과

/*
~a : -11
~b : 9
계속하려면 아무 키나 누르십시오 . . .
*/


/*
a = 10 → 00001010

			↓ ~a  (비트열반전)

		  11110101	→ '-11' → check? → (○)
		 +00001011	→ 11
		 ---------
	   (1)00000000  → 0
		 -
		 버림

b = -10   00001010 → 10
		  11110101
		 +       1
		 ---------
		  11110110 → -10

			↓ ~b (비트열반전)

		  00001001 → '9'	→ check? → (○)
		      8  1





*/